export default [{
	title: "简介",
	lines: ["你是这个世界的勇者", "你需要经过你的努力打败恶龙", "过程中你会遇到很多的帮助", "以及很多的陷阱"],
	choose: ["开始"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你从你的床上醒来", "你要干什么"],
	choose: ["吃早饭", "出去走走", "再睡一会"],
	cnext: ["你吃了早饭", "", "你躺在了床上"],
	next: [-1, 2, -2]
}, {
	title: "",
	lines: ["你来到了屋外的路上", "你要干什么"],
	choose: ["回家吃早饭", "回家再睡一会", "去铁匠铺"],
	cnext: ["你回家吃了早饭", "你回家躺在了床上", "你走向了铁匠铺"],
	next: [-1, -2, 3]
}, {
	title: "铁匠铺",
	lines: ["你来到了铁匠铺", "铁匠: 听说你要去迎战恶龙", "铁匠: 你需要准备一把称手的武器", "铁匠: 告诉我你需要什么", "铁匠: 没准我能帮上忙"],
	choose: ["离开", "制作武器"],
	cnext: ["你离开了铁匠铺", ""],
	next: [2, 4]
}, {
	title: "铁匠铺",
	lines: ["铁匠: 你想要什么样的武器"],
	choose: ["一把长剑"],
	cnext: ["你获得了一把长剑"],
	next: [5]
}, {
	title: "",
	lines: ["是时候该出发了"],
	choose: ["沿着东边的小路走", "沿着西边的大路走"],
	cnext: ["", ""],
	next: [6, 14]
}, {
	title: "",
	lines: ["你朝着东边走去", "遇到了一个旅馆"],
	choose: ["进入休息", "离开"],
	cnext: ["你进入了旅馆休息", "你在街头搭帐篷过夜"],
	next: [10, 9]
}, {
	title: "",
	lines: ["你朝着东边走去", "遇到了一个旅馆"],
	choose: ["进入休息", "离开"],
	cnext: ["你进入了旅馆休息", ""],
	next: [8, 12]
}, {
	title: "失败",
	lines: ["你在旅馆被刺杀了"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "失败",
	lines: ["你在外留宿后冻死在了路边"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你朝着东边走去", "遇到了一个商人"],
	choose: ["购买食物", "离开"],
	cnext: ["你补充了充足的食物", ""],
	next: [7, 11]
}, {
	title: "失败",
	lines: ["你在由于长时间的饥饿死在了路边"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你遇到了寺庙"],
	choose: ["进入", "离开"],
	cnext: ["", ""],
	next: [13, 11]
}, {
	title: "寺庙",
	lines: ["你进入了寺庙", "一心学习佛法", "逐渐修炼成佛", "忘记了你的目的"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你朝着西边走去", "遇到了一个旅馆"],
	choose: ["进入休息", "离开"],
	cnext: ["你进入了旅馆休息", ""],
	next: [15, 11]
}, {
	title: "旅馆",
	lines: ["你听见楼下有说话的声音"],
	choose: ["偷听", "睡觉"],
	cnext: ["", ""],
	next: [16, 8]
}, {
	title: "旅馆",
	lines: ["你听见旅馆老板想抢你的钱包"],
	choose: ["跳窗逃走", "与老板战斗"],
	cnext: ["", ""],
	next: [17, 18]
}, {
	title: "失败",
	lines: ["你摔死了"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "旅馆",
	lines: ["你打赢了老板"],
	choose: ["离开"],
	cnext: [""],
	next: [19]
}, {
	title: "",
	lines: ["门外有两条路"],
	choose: ["南边的大路", "北边的小路"],
	cnext: ["", ""],
	next: [20, 23]
}, {
	title: "",
	lines: ["你朝着南边的大路走去", "遇到了岔路"],
	choose: ["南边的大路", "西边的轮船"],
	cnext: ["", "你走上了轮船"],
	next: [21, 22]
}, {
	title: "罗马",
	lines: ["条条大路通罗马", "你到达了罗马"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "美洲大陆",
	lines: ["你开始了你的大航海", "发现了美洲大陆"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你朝着北边的小路走去", "发现了山洞"],
	choose: ["进入山洞", "直接离开"],
	cnext: ["你进入了山洞", ""],
	next: [24, 25]
}, {
	title: "山洞",
	lines: ["你在山洞里发现了一个土堆", "然后开始刨土", "于是你发现了世界上第一块山顶洞人的完整头盖骨"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "",
	lines: ["你找到了龙的巢穴"],
	choose: ["进入", "回家吃饭", "回家睡觉"],
	cnext: ["你进入了龙的巢穴", "", ""],
	next: [26, -3, -4]
}, {
	title: "龙巢",
	lines: ["你到了龙的巢穴"],
	choose: ["与龙战斗", "回家吃饭", "回家睡觉"],
	cnext: ["你进入了龙的巢穴", "", ""],
	next: [27, -3, -4]
}, {
	title: "龙巢",
	lines: ["你打败了恶龙"],
	choose: ["寻找龙蛋"],
	cnext: [""],
	next: [28]
}, {
	title: "龙巢",
	lines: ["你找到了龙蛋"],
	choose: ["破坏龙蛋", "孵化龙蛋", "回家吃饭", "回家睡觉"],
	cnext: ["", "", "", ""],
	next: [32, 29, -3, -4]
}, {
	title: "龙巢",
	lines: ["你开始孵化龙蛋", "孵化出了小龙"],
	choose: ["杀了吃肉", "放生"],
	cnext: ["", ""],
	next: [30, 31]
}, {
	title: "龙巢",
	lines: ["你被小龙杀死了"],
	choose: ["重生"],
	cnext: [""],
	next: [1]
}, {
	title: "龙巢",
	lines: ["你完成了你的任务"],
	choose: ["退出"],
	cnext: [""],
	next: [-5]
}, {
	title: "龙巢",
	lines: ["你完成了你的任务"],
	choose: ["退出"],
	cnext: [""],
	next: [-5]
}];
